Tekla Open API Reference for Tekla Structures 2025
Localization.RegisterLocalizationCallback Method
 Registers a localization callback which is used to translate the registered control types.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void RegisterLocalizationCallback(
	Localization.LocalizationCallback cb,
	params Type[] types
)
Public Sub RegisterLocalizationCallback (
	cb As Localization.LocalizationCallback,
	ParamArray types As Type()
)
Parameters
cb
Type: Tekla.Structures.Dialog.Localization.LocalizationCallback
The localization delegate.
types
Type: System.Type[]
An array of types which will trigger the current delegate.
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace